<?php

require_once('../functions/book_sc_fns.php');
session_start();
/******************************************
    
        初始化参数
    
*******************************************/
    $page_no 	= 3;
	$error_id 	= @$_REQUEST['error_id']; 
/******************************************
    
        头部
    
*******************************************/
    do_html_header('新增书籍','book_new');
	if($error_id){
		display_error_info($error_id);
	}
    login_up();
    display_logo();
    display_nav($page_no);

    display_intro('请提交书籍的详细信息');
    hr();


/******************************************
    
        BODY
    
*******************************************/
    book_form(1);
/******************************************
    
        尾部
    
*******************************************/
    do_html_footer();

?>