<?php

require_once('../functions/book_sc_fns.php');
session_start();
/******************************************
    
        初始化参数
    
*******************************************/
    $page_no = 1;   //当前页面编号是1

/******************************************
    
        头部
    
*******************************************/
    do_html_header('欢迎来到书店~');
    login_up();
    display_logo();
    display_nav($page_no);  //传入当前页面，画nav
    display_intro('新书速递');
    hr();

/******************************************
    
        BODY
    
*******************************************/

    $array = get_books_bynum();//取得所有的书籍，后续可以设定数量
    display_book_thumbnail($array); //在首页里展示书籍的图片、名称、作者

/******************************************
    
        尾部
    
*******************************************/

    do_html_footer();

?>