<?php

require_once('../functions/book_sc_fns.php');
session_start();
/******************************************
    
        初始化参数
    
*******************************************/
    $page_no = 2;


/******************************************
    
        头部
    
*******************************************/
    do_html_header('欢迎来到书店~');
    login_up();
    display_logo();
    display_nav($page_no);
    display_intro('请选择一个类别');
    hr();


/******************************************
    
        BODY
    
*******************************************/
    $cat_array = get_categories();    //读取所有的类别
    echo "<div class='container'>";
    display_categories($cat_array);   //展示类别
    echo "</div>";

/******************************************
    
        尾部
    
*******************************************/
    do_html_footer();

?>